[Killed] EqualityOperator
src/lib/utils/rules_matcher.ts:14:16
 const RANK: Record<MatchMode, number> = { is: 3, starts_with: 2, contains: 1 };
 
 export function matchRules(payee: string | null, rules: CategorizeRuleLite[]): string | null {
-	if (!payee || rules.length === 0) return null;
+	if (!payee || rules.length !== 0) return null;
 
 	const normalizedPayee = normalizePayee(payee);
killedBy: RulesStore matchTag returns tag_id when rule matches
statusReason: expected null to be '01KYPCXQGCG6DM4C4BD9E0YHWQ' // Object.is equality

[Killed] BooleanLiteral
src/lib/utils/rules_matcher.ts:14:6
 const RANK: Record<MatchMode, number> = { is: 3, starts_with: 2, contains: 1 };
 
 export function matchRules(payee: string | null, rules: CategorizeRuleLite[]): string | null {
-	if (!payee || rules.length === 0) return null;
+	if (payee || rules.length === 0) return null;
 
 	const normalizedPayee = normalizePayee(payee);
killedBy: RulesStore matchTag returns tag_id when rule matches
statusReason: expected null to be '01KYPCXP62VFV5VQSVP0BRVYKQ' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils/rules_matcher.ts:17:6
 	if (!payee || rules.length === 0) return null;
 
 	const normalizedPayee = normalizePayee(payee);
-	if (!normalizedPayee) return null;
+	if (true) return null;
 
 	const matches: CategorizeRuleLite[] = [];
killedBy: RulesStore matchTag returns tag_id when rule matches
statusReason: expected null to be '01KYPCXSYYV860EDMBVS0XPX9H' // Object.is equality

[Killed] BooleanLiteral
src/lib/utils/rules_matcher.ts:17:6
 	if (!payee || rules.length === 0) return null;
 
 	const normalizedPayee = normalizePayee(payee);
-	if (!normalizedPayee) return null;
+	if (normalizedPayee) return null;
 
 	const matches: CategorizeRuleLite[] = [];
killedBy: RulesStore matchTag returns tag_id when rule matches
statusReason: expected null to be '01KYPCXRTC9WPVM6SE1E7J0P6H' // Object.is equality

[Killed] ArrayDeclaration
src/lib/utils/rules_matcher.ts:19:40
 	const normalizedPayee = normalizePayee(payee);
 	if (!normalizedPayee) return null;
 
-	const matches: CategorizeRuleLite[] = [];
+	const matches: CategorizeRuleLite[] = ["Stryker was here"];
 
 	for (const rule of rules) {
killedBy: RulesStore matchTag returns tag_id when rule matches
statusReason: expected null to be '01KYPCXV6J9W873Z8M6QSNTJHW' // Object.is equality

[Killed] BlockStatement
src/lib/utils/rules_matcher.ts:21:28
 
 	const matches: CategorizeRuleLite[] = [];
 
-	for (const rule of rules) {
-		const normalizedTerm = normalizePayee(rule.payee_term);
-		if (!normalizedTerm) continue;
-		let isMatch = false;
-
-		switch (rule.match_mode) {
-			case 'is':
-				isMatch = normalizedPayee === normalizedTerm;
-				break;
-			case 'starts_with':
-				isMatch = normalizedPayee.startsWith(normalizedTerm);
-				break;
-			case 'contains':
-				isMatch = normalizedPayee.includes(normalizedTerm);
-				break;
-		}
-
-		if (isMatch) {
-			matches.push(rule);
-		}
-	}
+	for (const rule of rules) {}
 
 	if (matches.length === 0) return null;
killedBy: RulesStore matchTag returns tag_id when rule matches
statusReason: expected null to be '01KYPCXW8V3S711Z489FDC4XQE' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils/rules_matcher.ts:23:7
 
 	for (const rule of rules) {
 		const normalizedTerm = normalizePayee(rule.payee_term);
-		if (!normalizedTerm) continue;
+		if (false) continue;
 		let isMatch = false;
 
killedBy: matchRules ignores a whitespace-only contains term for a nonempty payee
statusReason: expected 'tag-1' to be null

[Killed] BooleanLiteral
src/lib/utils/rules_matcher.ts:23:7
 
 	for (const rule of rules) {
 		const normalizedTerm = normalizePayee(rule.payee_term);
-		if (!normalizedTerm) continue;
+		if (normalizedTerm) continue;
 		let isMatch = false;
 
killedBy: RulesStore matchTag returns tag_id when rule matches
statusReason: expected null to be '01KYPCXW91MG333AN4WQH4RA70' // Object.is equality

[Survived] BooleanLiteral
src/lib/utils/rules_matcher.ts:24:17
 	for (const rule of rules) {
 		const normalizedTerm = normalizePayee(rule.payee_term);
 		if (!normalizedTerm) continue;
-		let isMatch = false;
+		let isMatch = true;
 
 		switch (rule.match_mode) {

[Killed] ConditionalExpression
src/lib/utils/rules_matcher.ts:27:4
 		let isMatch = false;
 
 		switch (rule.match_mode) {
-			case 'is':
-				isMatch = normalizedPayee === normalizedTerm;
-				break;
+			case 'is':
 			case 'starts_with':
 				isMatch = normalizedPayee.startsWith(normalizedTerm);
killedBy: matchRules does not match a different or empty normalized payee
statusReason: expected 'tag-1' to be null

[Killed] StringLiteral
src/lib/utils/rules_matcher.ts:27:9
 		let isMatch = false;
 
 		switch (rule.match_mode) {
-			case 'is':
+			case "":
 				isMatch = normalizedPayee === normalizedTerm;
 				break;
killedBy: matchRules matches exact (is) rule
statusReason: expected null to be 'tag-1' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils/rules_matcher.ts:28:15
 
 		switch (rule.match_mode) {
 			case 'is':
-				isMatch = normalizedPayee === normalizedTerm;
+				isMatch = true;
 				break;
 			case 'starts_with':
killedBy: matchRules does not match a different or empty normalized payee
statusReason: expected 'tag-1' to be null

[Killed] EqualityOperator
src/lib/utils/rules_matcher.ts:28:15
 
 		switch (rule.match_mode) {
 			case 'is':
-				isMatch = normalizedPayee === normalizedTerm;
+				isMatch = normalizedPayee !== normalizedTerm;
 				break;
 			case 'starts_with':
killedBy: matchRules matches exact (is) rule
statusReason: expected null to be 'tag-1' // Object.is equality

[Survived] ConditionalExpression
src/lib/utils/rules_matcher.ts:30:4
 			case 'is':
 				isMatch = normalizedPayee === normalizedTerm;
 				break;
-			case 'starts_with':
-				isMatch = normalizedPayee.startsWith(normalizedTerm);
-				break;
+			case 'starts_with':
 			case 'contains':
 				isMatch = normalizedPayee.includes(normalizedTerm);

[Killed] MethodExpression
src/lib/utils/rules_matcher.ts:31:15
 				isMatch = normalizedPayee === normalizedTerm;
 				break;
 			case 'starts_with':
-				isMatch = normalizedPayee.startsWith(normalizedTerm);
+				isMatch = normalizedPayee.endsWith(normalizedTerm);
 				break;
 			case 'contains':
killedBy: matchRules matches starts_with rule
statusReason: expected null to be 'tag-1' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils/rules_matcher.ts:33:4
 			case 'starts_with':
 				isMatch = normalizedPayee.startsWith(normalizedTerm);
 				break;
-			case 'contains':
-				isMatch = normalizedPayee.includes(normalizedTerm);
-				break;
+			case 'contains':
 		}
 
killedBy: matchRules matches contains rule
statusReason: expected null to be 'tag-1' // Object.is equality

[Killed] StringLiteral
src/lib/utils/rules_matcher.ts:33:9
 			case 'starts_with':
 				isMatch = normalizedPayee.startsWith(normalizedTerm);
 				break;
-			case 'contains':
+			case "":
 				isMatch = normalizedPayee.includes(normalizedTerm);
 				break;
killedBy: matchRules matches contains rule
statusReason: expected null to be 'tag-1' // Object.is equality

[Killed] BlockStatement
src/lib/utils/rules_matcher.ts:38:16
 				break;
 		}
 
-		if (isMatch) {
-			matches.push(rule);
-		}
+		if (isMatch) {}
 	}
 
killedBy: matchRules matches exact (is) rule
statusReason: expected null to be 'tag-1' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils/rules_matcher.ts:38:7
 				break;
 		}
 
-		if (isMatch) {
+		if (false) {
 			matches.push(rule);
 		}
killedBy: matchRules matches exact (is) rule
statusReason: expected null to be 'tag-1' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils/rules_matcher.ts:43:6
 		}
 	}
 
-	if (matches.length === 0) return null;
+	if (true) return null;
 
 	// Find the highest rank
killedBy: matchRules matches exact (is) rule
statusReason: expected null to be 'tag-1' // Object.is equality

[Killed] EqualityOperator
src/lib/utils/rules_matcher.ts:43:6
 		}
 	}
 
-	if (matches.length === 0) return null;
+	if (matches.length !== 0) return null;
 
 	// Find the highest rank
killedBy: matchRules matches exact (is) rule
statusReason: expected null to be 'tag-1' // Object.is equality

[Killed] MethodExpression
src/lib/utils/rules_matcher.ts:46:18
 	if (matches.length === 0) return null;
 
 	// Find the highest rank
-	const maxRank = Math.max(...matches.map((m) => RANK[m.match_mode]));
+	const maxRank = Math.min(...matches.map(m => RANK[m.match_mode]));
 	const topMatches = matches.filter((m) => RANK[m.match_mode] === maxRank);
 
killedBy: matchRules ranks is > starts_with > contains
statusReason: expected 'tag-contains' to be 'tag-is' // Object.is equality

[Killed] ArrowFunction
src/lib/utils/rules_matcher.ts:46:42
 	if (matches.length === 0) return null;
 
 	// Find the highest rank
-	const maxRank = Math.max(...matches.map((m) => RANK[m.match_mode]));
+	const maxRank = Math.max(...matches.map(() => undefined));
 	const topMatches = matches.filter((m) => RANK[m.match_mode] === maxRank);
 
killedBy: RulesStore matchTag returns tag_id when rule matches
statusReason: expected null to be '01KYPCY9TQY5HCKB57ZAKG8T6Y' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils/rules_matcher.ts:47:43
 
 	// Find the highest rank
 	const maxRank = Math.max(...matches.map((m) => RANK[m.match_mode]));
-	const topMatches = matches.filter((m) => RANK[m.match_mode] === maxRank);
+	const topMatches = matches.filter((m) => true);
 
 	// If all top matches target the same tag, return it; otherwise null (ambiguous)
killedBy: matchRules ranks is > starts_with > contains
statusReason: expected null to be 'tag-is' // Object.is equality

[Killed] MethodExpression
src/lib/utils/rules_matcher.ts:47:21
 
 	// Find the highest rank
 	const maxRank = Math.max(...matches.map((m) => RANK[m.match_mode]));
-	const topMatches = matches.filter((m) => RANK[m.match_mode] === maxRank);
+	const topMatches = matches;
 
 	// If all top matches target the same tag, return it; otherwise null (ambiguous)
killedBy: matchRules ranks is > starts_with > contains
statusReason: expected null to be 'tag-is' // Object.is equality

[Killed] ArrowFunction
src/lib/utils/rules_matcher.ts:50:44
 	const topMatches = matches.filter((m) => RANK[m.match_mode] === maxRank);
 
 	// If all top matches target the same tag, return it; otherwise null (ambiguous)
-	const uniqueTags = new Set(topMatches.map((m) => m.tag_id));
+	const uniqueTags = new Set(topMatches.map(() => undefined));
 	if (uniqueTags.size === 1) {
 		return topMatches[0].tag_id;
killedBy: matchRules returns null on tie with different tags
statusReason: expected 'tag-1' to be null

[Killed] BlockStatement
src/lib/utils/rules_matcher.ts:51:29
 
 	// If all top matches target the same tag, return it; otherwise null (ambiguous)
 	const uniqueTags = new Set(topMatches.map((m) => m.tag_id));
-	if (uniqueTags.size === 1) {
-		return topMatches[0].tag_id;
-	}
+	if (uniqueTags.size === 1) {}
 
 	return null;
killedBy: matchRules matches exact (is) rule
statusReason: expected null to be 'tag-1' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils/rules_matcher.ts:51:6
 
 	// If all top matches target the same tag, return it; otherwise null (ambiguous)
 	const uniqueTags = new Set(topMatches.map((m) => m.tag_id));
-	if (uniqueTags.size === 1) {
+	if (true) {
 		return topMatches[0].tag_id;
 	}
killedBy: matchRules returns null on tie with different tags
statusReason: expected 'tag-1' to be null
